{
    "date": "2020-06-25T16:49:00.249Z",
    "body": "It’s time for me to talk about books.\n\nI’ve read quite a few great books this year already, and eight of them have been five star reads. When put like that it sounds like I’m on the generous side with my ratings, but in reality I’m just a little picky with the books I fancy reading.\n\nSo here’s a little list of five of those incredible reads, from an array of genres and popularity, along with why I think they deserved their stars.\n\n&nbsp;\n\n![](/images/810uwsoxqhl.jpg)\n\n*Fairytale inspired fantasy: Spinning Silver by Naomi Novik*\n\nStarting off with my personal favourite from the bunch, this charming standalone follows three young women, from a cross section of society, who’s stories of hardship intertwine. Miryem (the daughter of a money lender), Irina (the daughter of a social climbing duke) and Wanda (a peasant girl) live in a harsh wintry world where the men in their lives determine their paths- or at least attempt to. With support from each other, these women defy the constraints put upon them in a beautiful display of bravery and empowerment.\n\nI devoured this book during a couple of rainy days at a traditional little house in Kyoto. The house oozed character, from the sliding doors, and the dangerously steep ladder-like staircase, to the chunky wooden beams we slept under in the loft. It was the perfect setting to accompany this Eastern European folklore inspired tale, under the protection of a cozy duvet. I was so incredibly invested in these characters, I stepped into its pages late into the night (like Irina) just to find out what would unfold next.\n\nI am genuinely sad to have to leave these characters behind until an inevitable reread, as they are without a doubt my new favourite female protagonists of all time. There’s just something about the female bond and that women from all walks of life can find commonality. Stunning, stunning book.\n\n&nbsp;\n\n![](/images/71mbwcwsjil.jpg)\n\n*Romance: Well Met by Jen DeLuca*\n\nOkay, onto something quite different, where the male characters aren’t scary ice kings, or possessed by fire demons. Well Met is the fun, hate-to-love romance between Emily, your easygoing, fun loving, recently dumped protagonist, and Simon, your seemingly uptight, judgemental English teacher and local Renaissance Faire organiser. These two could not be more opposed to one another. That is, before the ren faire starts. Once Emily and Simon take on their roles, there seems to be an odd, sort of hot chemistry between them. The question is, is it just their characters, or is this the real deal?\n\nI seriously loved this premise when I heard about it in one of booktuber Riley Marie’s videos. Although I was recently new to the romance genre, I knew that enemies-to-lovers was easily my favourite troupe. The perfectly unbearable tension, the will-they-won’t-they, the agonising build up of chemistry! DeLuca did a fantastic job at all of these.\n\n&nbsp;\n\n![](/images/91hb0fy5zfl.jpg)\n\n*Science fiction thriller: The Luminous Dead by Caitlin Starling*\n\nAnother five star recommendation from Riley Marie, The Luminous Dead follows Gyre, a desperate woman who fakes her way onto a deadly expedition. During her mission underground, Gyre’s only contact with the surface is Em, who talks to Gyre through a speaker in her suit, and who also has total control over her body, and therefore her survival. If that wasn’t creepy enough, with each descent of the cave Gyre realises that this expedition is more dangerous and twisted than she could ever have imagined.\n\nThis book is an amazingly written and atmospheric psychological thriller which had me constantly squealing and wide eyed. Starling masterfully tells the haunting story of two women attempting to find their purpose and the danger of delving too deeply into the past.\n\nListening on Audible made me feel like I was alone in the dark with Gyre, and I’m beyond excited to get a physical copy for my next read. This would be the book I would easily recommend to anyone I meet no matter their taste, despite being my ‘least popular’ read this year according to Goodreads (read by the least people). It’s just a great experience. Two characters and a cave, how did Starling make this everything that it is?!\n\n&nbsp;\n\n![](/images/71nc7aqjopl.jpg)\n\n*A Historical fiction: The Kite Runner by Khaled Hosseini*\n\nbook that really needs no introduction. But I will just in case. The Kite Runner is the heartbreaking and poignant story of Amir’s life, growing up as a young boy in Kabul, Afghanistan and, as his home descends into ruin, leaving for San Francisco as a young man. This is a book about friendship, betrayal, guilt and sacrifice. It also explores the complexity of bonds between father and son and the many male figures a young man encounters in his life. There are real moral and human lessons here, none of which are approached in a condescending way, which is what I love about Hosseini.\n\nAlthough it tackles some devastating and intimidating topics, do not let that put you off. Hosseini’s descriptions of Afghanistan, a country I am unlikely to ever visit, is breathtaking, an absolute pleasure to read, and gives me a little insight into the world my father-in-law must have grown up in. I will definitely be reading more of Hosseini’s books in the near future.\n\n> My favourite quote, spoiler friendly; “...lifting him from the certainty of turmoil and dropping him into a turmoil of uncertainty”.\n\n&nbsp;\n\n![](/images/04yt_neil_gaimen.jpg)\n\n*Children’s: Coraline by Neil Gaiman*\n\nFor my fifth and final five star read I’m taking it back to childhood. This is probably up there among the creepiest children’s books I’ve ever read, so I’m glad I only just got around to reading this for the first time at twenty-two!\n\nCoraline is the twisted story of a little girl who discovers an alternate reality through an oddly behaved door. Coraline craves adventure, like any other child of her age, she wants to go out and explore. Her life in the normal world is boring, grey, nobody pays her any attention, and her neighbours can’t even get her name right. Through the tunnel behind the door her *other* life, with her *other* parents, is magical...at first. This is a delightfully dark and quirky story with wonderful characters. I’m especially fond of the cat.\n\nI definitely recommend Bloomsbury’s special edition copy, illustrated by Chris Riddell, published back in 2013. I got my copy from Waterstones online at the beginning of lockdown. It does an amazing job at breathing new life into Coraline’s adventure, especially if you’ve already watched the Tim Burton adaptation. Each illustration placed before a chapter gives you a hint at what you might expect and I was obsessed with the other mother’s transformation. Just so scary and so good. I apologise to my future children in advance for the nightmares (sorry).\n\nWhat I simply love about this book is that Coraline is so fearless and determined. Maybe if I read this sooner I would’ve picked up a thing or two.\n\n&nbsp;\n\n*Wrap up*\n\nThere, I hope that I justified these five star reads. What seems clear now to my enjoyment of a book are strong characters (especially women) and interesting ideas, no matter what genre I pick up. I’m simple like that.\n\n&nbsp;\n\nThanks for reading.",
    "title": "Five genres, five books, five star reads",
    "image": "/images/107388339_329653111531565_8717197893940064406_n.jpg"
}