{
  "date": "2020-05-08T20:22:11.466Z",
  "title": "the a-z bookish survey",
  "body": "<!--StartFragment-->\n\nI’ve been reading so much lately and wished to share my love of books on my blog. So I’m starting with the A-Z tag I saw on HollieBlog!\n\n**Author you've read the most books from**\n\nI’ve read eleven books by Meg Cabot- the author who first got me excited about reading! These include; the Mediator series, the Airhead series, Avalon High, How to be Popular, and Teen Idol. I mainly read these in my tween years, but I always return to them for the nostalgia factor.\n\n![](/images/travel.jpg)\n\n**Best sequel ever**\n\nDefinitely New Moon by Stephanie Meyer! It was always the one I went back to. It was an absolute mood when I was fifteen/sixteen years old and I would not speak to anyone during. Plus reading it to the New Moon OST was everything.\n\n**Currently reading**\n\nThrone of Glass by Sarah J.Maas. I’m reading this for the first time, as part of the OWLs Magical Readathon, after my sister begged me to for years.\n\n**Drink of choice while reading**\n\nOh. Tea. 100%.\n\n**E-reader of physical book**\n\nPhysical book everytime. My kindle gave up on me about seven years ago haha. Plus I like to see my books.\n\n**Fictional character you would have actually dated in high school**\n\nPatch from Hush Hush by Becca Fitzpatrick, all day, everyday. Would I date him now? Nope. Was I obsessed at the time? Of course! Although he would've been out of my league, so I probably wouldn’t have had the chance.\n\n**Glad you gave this book a chance**\n\nIt would have to be The Luminous Dead by Caitlin Starling. I don’t usually read thrillers, horror, or sci-fi, and this book isn’t too well known or popular. In fact, I think it’s the least popular book (by this I mean fewer people have read it) on Goodreads that I’ve read this year. But I gave it a chance, as it was reccommended by my favourite booktuber Riley Marie, and it ended up being a five star read and one of my all time favourites!\n\n**Hidden gem book**\n\nAgain, it has to be The Luminous Dead. It needs more attention!\n\n**Important moment in your reading life**\n\nThe time that I read TurtlesAll the Way Down by John Green. It was during my second year of university when I was commuting back and forth to my boyfriend’s house in another city. My mental health was suffering and I really needed this book in my life to help me understand how I was feeling.\n\n**Just finished**\n\nRed, White & Royal Blue by Casey McQuiston. I gave it four stars.\n\n**Kinds of books you won’t read**\n\nI’m not really into memoirs. The only one I’ve read was Becoming by Michelle Obama which I gave five stars to. Although I loved that book, especially in the audiobook format, I don't think I’d reach for another.\n\n**Longest book you’ve read**\n\nThat would be Harry Potterand the Order of the Phoenix at 870 pages!\n\n**Major book hangover because of**\n\nWell Met by Jen DeLuca. Not because it was sad in any way. It was just such a great book and the best romance I’ve ever read that I was devastated when it was over! I didn’t want to leave the characters or the setting. But I know there are two more in the series, so yay for me.\n\n**Number of bookcases you own**\n\nJust one! But I also have some shelves built into my desk which I use too.\n\n**One book you have read multiple times**\n\nAll of the Harry Potters! I listen to them on Audible as a comfort thing. But if I had to pick one it would be Prisoner of Azkaban. My parents got me the audiobook CDs of the first three when I was young and I listened to that one on repeat.\n\n**Preferred place to read**\n\nThe swing seat in my parent’s garden. It has been saving me since quarantine started. I’m really lucky to have that space, to swing and listen to the birds.\n\n**Quote that inspires you/gives you all the feels from a book you’ve read**\n\nOne of the quotes from John Green’s Turtles All the Way Down that helped me. I immediately sat up in bed and HAD to tell my boyfriend why it was so meaningful.\n\n> You're both the fire and the water that extinguishes it. You're the narrator, the protagonist, and the sidekick. You're the storyteller and the story told. You are somebody's something, but you are also your you.\n\n**Reading regret**\n\nCan You Keep a Secret by Sophie Kinsella. I read it thinking it would be as good as another book of hers, I’ve Got Your Number. Spoiler: it wasn’t. I didn’t see any chemistry between the protagonist, Emma, and the love interest (can’t remember his name despite reading it this year haha), and Emma was so whiny. I gave it two stars, but only because I managed to finish it.\n\n**Series you started and need to finish (all books are out in the series)**\n\nThe Mediator by Meg Cabot. I think I got so close to finishing these but kind of grew out of them and moved on to other series. I feel a duty to finish these though, because they’re still a pleasure to read AND of course I wanna find out what happens to Suze and Jesse!\n\n**Three of your all-time favourite books**\n\n* And Then There Were None by Agatha Christie (the first murder mystery I ever read)\n* Spinning Silver by Naomi Novik (a recent read where I discovered my favourite female characters)\n* Hush Hush by Becca Fitzpatrick (the book that catapulted me into YA as a teenager, and got me excited to talk about books)\n\n**Very excited about this release more than all the others**\n\nWell Played by Jen DeLuca, the sequel to Well Met, aka my favourite romance of all time. I am slightly nervous to read a book where the characters I fell in love with aren't the focus BUT I’m incredibly excited to waltz back into the world of ren faire and see what’s going on with all of them!\n\n**Worst bookish habit**\n\nIt would probably be not finishing books, or putting them off. I have certain books in my collection which aren‘t my thing, but I still want to read, and I’ll either put them off or start reading and pause at around 25% (and usually trade them for something more fun and easy to read, oops).\n\n**Your latest book purchase**\n\nAbout half way through writing this blog post, I bought my favourite edition of the Mediator series second hand from Amazon. But before this, my last purchase(s) were the books I bought for Smutathon at the end of this week! I’ll be writing a blog post about them soon.\n\n**Zzz-snatcher book (last book that kept you up WAY late)**\n\nThe Luminous Dead! Although, maybe it was because it was so scary that I couldn’t fall asleep...\n\nIf you’ve made it, thank you for reading this far! I hope you enjoyed my answers and I encourage you to come up with your own, even if that’s just discussing these questions with you\n\n![]()\n\n<!--EndFragment-->"
}