{
  "date": "2020-08-24T15:50:30.795Z",
  "body": "**I’m going to be co hosting a Bratz themed readathon!**\n\nThis is a month-long readathon taking place from 1st-30th September 2020, for the first time ever. There are 4 prompts per team, the teams being Sasha, Cloe, Yasmin and Jade, and a group book. There will also be a few [instagram](https://www.instagram.com/bratzreadathon/) challenges taking place throughout the month, and one life challenge.\n\nThis readathon is all about your enjoyment, so there are no strict rules. For example, feel free to double up on prompts and pick and choose prompts from different teams. However, there is a sign up sheet [here](https://docs.google.com/forms/d/e/1FAIpQLSdSpDJRJzkW2-VAxPJdHhUcR21UupAEIA_mLN2lbXdDMwo5ZA/viewform), where you can choose which team you’d like to join! You can pick whichever Bratz doll you love the most, or go by the prompts you find most appealing, OR you could also take the [buzzfeed quiz](https://www.buzzfeed.com/cassiesmyth/which-bratz-doll-are-you) to find out who you are most similar to.\n\nTHE GROUP BOOK\n\nTo celebrate the upcoming female/female relationship in Bratz history, Nevra and Roxxi, we chose a f/f romance: [The Henna Wars by Adiba Jaigirdar](https://www.goodreads.com/book/show/44286258-the-henna-wars).\n\n![](/images/9780593216569.jfif)\n\nThis is a rom com about two teenage girls Nishat and Flavia. Nishat is crushing on Flavia, but when their school holds a competition and they both choose to create henna businesses, Nishat has to deal with the fact that Flavia, the girl she’s fallen for, is appropriating her culture.\n\nI’m really excited that we’re going to be reading this together and delving into some really important conversations. There will also be a live show towards the end of the month to discuss the group book (hosted by team Sasha and team Cloe). We will also be doing another live show to wrap up the readathon. All of these dates will be announced soon!\n\n\n\nTEAM JADE\n\nAs I am representing team Jade, I thought I would go more into detail about these prompts.\n\n![](/images/efbn4hdu8aebjtp.png)\n\nKool Kat- read a book featuring a cat. This can be a character in the book, or a cat on the cover, or maybe even a character called Kat/Cat. You can get as creative as you like with these prompts, so perhaps pick a book by an author named Kat/Cat, for example the [Wicked Fox](https://www.goodreads.com/book/show/42133479-wicked-fox) duology by Kat Cho ([here](https://www.goodreads.com/review/list/71027872-bambina-katarina?ref=nav_mybooks&shelf=featuring-a-cat-s) is the goodreads list with some more examples).\n\nEast Asian- read an own voices east asian book. So for this prompt we would like you to pick a book by an East Asian author, preferably with an East Asian main character, for example, Korean or Japanese ([here](https://www.goodreads.com/review/list/71027872-bambina-katarina?ref=nav_mybooks&shelf=east-asian-mc-author) is my goodreads list for this prompt).\n\nFavourite colour- read a book with green on the cover. We decided on this prompt because Jade’s favourite colour is green. It doesn’t have to be a lot of green, as long as there is some green on the cover, we’ll accept it! I also know that [The Late Night Book Club](https://twitter.com/thelatenightbc)’s September pick is [The Seven Husbands of Evelyn Hugo by Taylor Jenkins Reid](https://www.goodreads.com/book/show/32620332-the-seven-husbands-of-evelyn-hugo?ac=1&from_search=true&qid=7piqiHUeg3&rank=1), which has green on the cover, so I encourage you to read it for this prompt if you are taking part in both ([here](https://www.goodreads.com/review/list/71027872-bambina-katarina?ref=nav_mybooks&shelf=green-on-the-cover) is the goodreads list with some more examples).\n\nPassion 4 fashion- read a trendy book. What we mean by this is any popular book, especially if it is popular right now, so a hyped book that a lot of people have read. This is an entirely subjective prompt so go wild! ([here](https://www.goodreads.com/review/list/71027872-bambina-katarina?ref=nav_mybooks&shelf=trendy-books) is my goodreads list for this prompt).\n\nSASHA, YASMIN & CLOE\n\nHere are the other team’s prompts:\n\n![](/images/efbocn1ucae9rmp.png)\n\n![](/images/efboqn-u0aayqem.png)\n\n![](/images/efbohj0uyaiwbv_.png)\n\nEXTRA INFO\n\nWe have a bonus life challenge which is to watch a Bratz movie, a lot of them are free to watch on youtube! This can be the cartoons or the live action one, whatever you want. I’ll probably be live tweeting on [my twitter](https://twitter.com/bxmbinakatarina) while I watch the movies throughout the readathon if you want to join me. There will also be some instagram challenges for you to take part in on [our official instagram page](https://www.instagram.com/bratzreadathon/).\n\nI will be coming out with my September TBR video at the end of the month over on [my booktube channel](https://www.youtube.com/channel/UCYwp6yuXeUZBSI6n1RrDMEw?view_as=subscriber) to let you guys know what I'll be reading once all my books have arrived! But to give you a little hint, I will definitely be reading [Vicious Spirits](https://www.goodreads.com/book/show/48929807-vicious-spirits?ac=1&from_search=true&qid=nQjfG6rvxX&rank=1) by Kat Cho for one of the prompts!\n\nSo that’s all from me, if you have any questions feel free to ask me, or send them to our social media on twitter [@bratzread](https://twitter.com/bratzread) or instagram [@bratzreadathon](https://www.instagram.com/bratzreadathon/) and make sure to follow us there for updates and reading sprints!\n\n\n\nTeam Jade:\n\n* Katarina (me) [@bxmbinakatarina](https://twitter.com/bxmbinakatarina)\n* Jadeth [@jadethsreads](https://twitter.com/jadethsreads)\n\nTeam Yasmin:\n\n* Candace (host) [@trashytomes](https://twitter.com/trashytomes)\n* Tyra [@tyraandthebooks](https://twitter.com/tyraandthebooks)\n\nTeam Sasha:\n\n* JaNae [@JHeartLuvsbooks](https://twitter.com/JHeartLuvsbooks)\n* Saoudia [@hotgirlreads](https://twitter.com/hotgirlreads)\n\nTeam Cloe:\n\n* Preet [@Thebookishnook1](https://twitter.com/Thebookishnook1)\n* Kayleigh [@kayleighreads](https://twitter.com/kayleighreads)",
  "title": "Bratz readathon announcement",
  "image": "/images/ef0k9phwkaiw9tz.jfif"
}