{
  "date": "2020-07-03T22:38:49.659Z",
  "title": "Normal People by Sally Rooney",
  "image": "/images/718qpkmo2zl.jpg",
  "body": "###### Rating: ☆☆☆☆☆\n\nKind of like Marianne, people either seem to love this book or hate it. I’m happy to declare, after listening to it on Audible for seven and a half hours over five and a half days, I’m in love!\n\n(And a little bit wrecked)\n\nNormal People is the quiet story of Connell and Marianne, picking us up during their last year at high school and dropping us off as they’re finishing up college. In their hometown of Sligo, Ireland, Connell is popular and desired, Marianne is pretty much the opposite, and yet they’re magnetically drawn together. Rooney captures the agonisingly realistic complexity of a first love that just won’t leave you. I know I’m an advocate for the will-they-won’t-they dynamic, but these two will have you punching a pillow. In the best way possible, I promise. Genre suggestion: torture I’d read again?\n\nI adored Connell. Easily the most relatable character (hard to use that word because he is so real, he seriously exists somewhere), he’s truly someone I see myself in, and in some aspects, see my boyfriend in as well. It hit me when he expresses his disappointment at failing to find ‘like-minded people’ at college, something I’m sure a lot of us feel at some point. Connell’s also responsible for my favourite quote of the book, and possibly ever, “That's money, the substance that makes the world real”, which I know is so obvious, but it made me sad with realisation hearing it. He’s just so precious and I wish all the Connells of the world happiness.\n\nAnother thing I loved about this book was the way it jumped forward in time (I’m sure there’s a technical word for that which Connell would know, but I didn’t study English Lit), and all of the little flashbacks. I had no clue when the story would cut to months down the line, and when Rooney did this I was like YES transport me! What’s happened since we saw them? Who's in the picture? Where are we? A part of me was also scared to know these things. If you’ve read it, you’ll understand how fragile I felt. I don’t know if it was down to this format, but I could not stop consuming this book. \n\nI would thoroughly recommend listening to the audiobook in the car on a long journey, or in bed after lights out, like I did. Anywhere that you can fully submerge in the language and the dialogue, oh the dialogue. I’ll definitely be purchasing a physical copy at some point soon, just so I can consume this in another way- I finished the series the same day I finished the book. \n\nTo wrap up, Normal People is a sexy yet incredibly tender millennial love story, intertwined with important conversations about mental health, family, friendship and navigating early adult life."
}