{
  "date": "2020-07-11T21:49:03.737Z",
  "title": "Six of Crows by Leigh Bardugo",
  "image": "/images/107518903_290859852257595_1868624479227649352_n.jpg",
  "body": "Rating: ☆☆☆☆☆\n\n\n\nThis book takes me right back to being a teenager and I love that.\n\n\n\nSix of Crows is about Kaz Brekker, a notorious young criminal, who assembles a crew of six misfits in order to pull off an impossible heist. This is in the fantasy genre, with really unique magical elements, set in a harsh world I believe to be inspired by the Netherlands. The main island city in this book, Ketterdam, reminds me so much of Amsterdam’s canals, bars and brothels, which really captures the vibe of the book- dark and charming.\n\n\n\nI read Six of Crows as part of the ‘Make Your Myth Taker’ readathon, hosted by Ashleigh ([@afrolicthroughfiction](https://www.instagram.com/afrolicthroughfiction/)) and Charlotte ([@beigepages](https://www.instagram.com/beigepages/)), for the water setting prompt. Unfortunately, at the beginning of the month, I could not concentrate on reading at all. I think this, coupled with the consensus that it’s a little hard to get into this book, was why I took nearly three weeks to read it! But that doesn’t mean it wasn’t *the* best (which is definitely reflected in my rating).\n\n\n\n\\~Spoiler warning\\~\n\n\n\nStarting with the important stuff. These characters are perfection. I am big on dynamics, so the interaction, friendships and emerging love between the six of them was everything to me. I loved the intensity between Kaz and Inej. Inej is one of my favourites for sure. She’s independent and a badass; in a show-not-tell kind of way. I think at the beginning, Inej was the main pull for me to keep reading because I found her so intriguing. I mean, the fact that the first chapter (after the prologue bit) is from her point of view, climbing onto a roof, was a great choice.\n\n\n\nBut controversial opinion alert...I ship Nina and Matthias more. I think Nina is just another stand out character to me, if not my absolute favourite, and I feel like this book is a love letter to her. The flashbacks were so perfectly intertwined with the plot, and gave me just enough each time. These two encompass every trope I adore: hate-to-love, forced proximity and- a new one for me- huddling for warmth.\n\n\n\nChapter 37, page 416, “*I have been made to protect you. Only in death will I be kept from this oath*”. Stop it right now! That was the most gorgeous moment. Nina and Matthias forever, even if Matthias is punching.\n\n\n\nAnd then the bit that I read the fastest by far was when they were actually doing the heist part, mainly part five- the ice does not forgive. This part was just so so good. I loved the short chapters, and the timeline jumping back and forth every time we got a new perspective. But most of all, I loved the development in the relationship between Jesper and Wylan. When I thought Jesper was going to get caught and Wylan saved him- so funny.\n\n\n\nThat also seemed to be a theme for me reading this book. For some reason I was really dumb and did not see anything coming, at all! I know how books work- the characters get into sticky situations that you don’t think they can get out of, but of course they do. Well, I genuinely forgot that’s how books work! So when another character swooped in I was shocked. SHOCKED. Is that just me, or is Leigh Bardugo just really talented?\n\n\n\nOverall, I easily gave Six of Crows five stars, despite the slow start. I fell in love with the characters and really enjoyed the setting. It reminded me of how fun it can be to read a fantasy that doesn’t take itself too seriously- fantasies can be epic and action packed, and also be a bit goofy and follow a group of teenagers struggling to express their feelings. I’m super excited to read Crooked Kingdom next."
}